eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_dma.h
/**
  ******************************************************************************
  * @file    MDR32F9Qx_dma.h
  * @author  Phyton Application Team
  * @version V1.4.0
  * @date    11/06/2010
  * @brief   This file contains all the functions prototypes for the DMA
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 Phyton</center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_dma.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F9Qx_DMA_H
#define __MDR32F9Qx_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stdint.h"	
#include "mdr32f8_config.h"
#include "MDR1986VE8T.h"	

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @addtogroup DMA
  * @{
  */

/** @defgroup DMA_Exported_Types DMA Exported Types
  * @{
  */

/**
  * @brief  DMA Channel Primary / Alternate Control Data initialization structure definition
  */

typedef struct
{
  uint32_t DMA_SourceBaseAddr;                 /*!< Specifies the source base address for DMA Channelx. */

  uint32_t DMA_DestBaseAddr;                  /*!< Specifies the destination base address for DMA Channelx. */

  uint32_t DMA_SourceIncSize;                 /*!< Specifies the source address register increment value.
                                                 This parameter can be a value of @ref DMA_source_incremented_mode */

  uint32_t DMA_DestIncSize;                   /*!< Specifies the destination address register increment value.
                                                 This parameter can be a value of @ref DMA_dest_incremented_mode */

  uint32_t DMA_MemoryDataSize;                /*!< Specifies the Memory data width.
                                                 This parameter can be a value of @ref DMA_memory_data_size */

  uint32_t DMA_Mode;                          /*!< Specifies the operation mode of the DMA Channelx.
                                                 This parameter can be a value of @ref DMA_operating_mode. */

  uint32_t DMA_CycleSize;                     /*!< Specifies the  total number of DMA transfers that the DMA cycle contains.
                                                 This parameter can be a value of @ref DMA_cycle_size. */

  uint32_t DMA_NumContinuous;                 /*!< Specifies how many DMA transfers can occur before the DMA controller rearbitrates.
                                                 This parameter can be a value of @ref DMA_number_continuous_transfers. */

  uint32_t DMA_SourceProtCtrl;                /*!< Specifies the DMA Source protection control.
                                                 This parameter can be a value of @ref DMA_source_protection_control. */

  uint32_t DMA_DestProtCtrl;                  /*!< Specifies the DMA Destination protection control.
                                                 This parameter can be a value of @ref DMA_dest_protection_control. */
} DMA_CtrlDataInitTypeDef;

/**
  * @brief  DMA Channel Control Data structure definition
  */

typedef struct
{
  uint32_t DMA_SourceEndAddr;                 /*!< Specifies the DMA channel source end address */

  uint32_t DMA_DestEndAddr;                   /*!< Specifies the DMA channel destination end address. */

  uint32_t DMA_Control;                       /*!< Specifies the DMA channel control data configuration. */

  uint32_t DMA_Unused;                        /*!< Specifies the DMA channel unused memory. */

}DMA_CtrlDataTypeDef;

/**
  * @brief  DMA Channel Init structure definition
  */

typedef struct
{
  DMA_CtrlDataInitTypeDef *DMA_PriCtrlData;   /*!< Specifies the pointer to the primary control data structure.
                                                 This parameter should be NULL if primary data structure is not used */

  DMA_CtrlDataInitTypeDef *DMA_AltCtrlData;   /*!< Specifies the pointer to the alternate control data structure.
                                                 This parameter should be NULL if alternate data structure is not used */

  uint32_t DMA_ProtCtrl;                      /*!< Specifies the AHB-Lite protection control.
                                                 This parameter can be a value of @ref DMA_AHB_protection_control. */

  uint8_t DMA_Priority;                       /*!< Specifies the software priority for the DMA Channelx.
                                                 This parameter can be a value of @ref DMA_priority_level */

  uint8_t DMA_UseBurst;                       /*!< Disables single request to generate DMA requests for the DMA Channelx.
                                                 This parameter can be a value of @ref DMA_burst_mode */

  uint8_t DMA_SelectDataStructure;            /*!< Specifies the primary /alternate data structure to use by the DMA channel.
                                                 This parameter can be a value of @ref DMA_data_structure_selection. */

} DMA_ChannelInitTypeDef;

/**
  * @brief  DMA Channel Scatter-Gather Init structure definition
  */

typedef struct
{
  DMA_CtrlDataTypeDef *DMA_SG_TaskArray;      /*!< Specifies the pointer to the Scatter-Gather task structures array. The size
                                                 of the array should be equal to DMA_SG_TaskNumber.
                                                 Every structure of the array should contain the copy of the alternate control
                                                 data for the related task. It will be used by DMA to configure
                                                 the alternate control data while operating in the
                                                 scatter-gather mode */

  uint32_t DMA_SG_TaskNumber;                 /*!< Specifies the number of scatter-gather tasks to be executed by DMA */


  uint32_t DMA_SourceProtCtrl;                /*!< Specifies the Primary Control Data DMA Source protection control.
                                                 This parameter can be a value of @ref DMA_source_protection_control. */

  uint32_t DMA_DestProtCtrl;                  /*!< Specifies the Primary Control Data DMA Destination protection control.
                                                 This parameter can be a value of @ref DMA_dest_protection_control. */

  uint32_t DMA_ProtCtrl;                      /*!< Specifies the AHB-Lite protection control.
                                                 This parameter can be a value of @ref DMA_AHB_protection_control. */

