eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_dma.h
  uint8_t DMA_Priority;                       /*!< Specifies the software priority for the DMA Channelx.
                                                 This parameter can be a value of @ref DMA_priority_level */

  uint8_t DMA_UseBurst;                       /*!< Disables single request to generate DMA requests for the DMA Channelx.
                                                 This parameter can be a value of @ref DMA_burst_mode */

} DMA_Channel_SG_InitTypeDef;


/** @} */ /* End of group DMA_Exported_Types */

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_channels_number DMA channels number
  * @{
  */

#define IS_DMA_CHANNELS(NUMBER) ((NUMBER >= 1) && (NUMBER <= 32))

/** @} */ /* End of group DMA_channels_number */

/** @defgroup DMA_alternate_data_usage DMA alternate data usage
  * @{
  */

#define DMA_ALternateDataDisabled           ((uint16_t)(0x00))
#define DMA_ALternateDataEnabled            ((uint16_t)(0x01))

#define IS_DMA_ALTERNATE_DATA(STATE)        (((STATE) == DMA_ALternateDataDisabled) || \
                                            ((STATE)  == DMA_ALternateDataEnabled))

/** @} */ /* End of group DMA_alternate_data_usage */

/** @defgroup DMA_valid_channels DMA valid channels
  * @{
  */
#if defined (USE_MDR1986VE9x)

#define DMA_Channel_UART1_TX    ((uint8_t)(0))
#define DMA_Channel_UART1_RX    ((uint8_t)(1))
#define DMA_Channel_UART2_TX    ((uint8_t)(2))
#define DMA_Channel_UART2_RX    ((uint8_t)(3))
#define DMA_Channel_SSP1_TX     ((uint8_t)(4))
#define DMA_Channel_SSP1_RX     ((uint8_t)(5))
#define DMA_Channel_SSP2_TX     ((uint8_t)(6))
#define DMA_Channel_SSP2_RX     ((uint8_t)(7))
#define DMA_Channel_ADC1        ((uint8_t)(8))
#define DMA_Channel_ADC2        ((uint8_t)(9))
#define DMA_Channel_TIM1        ((uint8_t)(0))//10
#define DMA_Channel_TIM2        ((uint8_t)(11))
#define DMA_Channel_TIM3        ((uint8_t)(12))
#define DMA_Channel_SW1         ((uint8_t)(13))
#define DMA_Channel_SW2         ((uint8_t)(14))
#define DMA_Channel_SW3         ((uint8_t)(15))
#define DMA_Channel_SW4         ((uint8_t)(16))
#define DMA_Channel_SW5         ((uint8_t)(17))
#define DMA_Channel_SW6         ((uint8_t)(18))
#define DMA_Channel_SW7         ((uint8_t)(19))
#define DMA_Channel_SW8         ((uint8_t)(20))
#define DMA_Channel_SW9         ((uint8_t)(21))
#define DMA_Channel_SW10        ((uint8_t)(22))
#define DMA_Channel_SW11        ((uint8_t)(23))
#define DMA_Channel_SW12        ((uint8_t)(24))
#define DMA_Channel_SW13        ((uint8_t)(25))
#define DMA_Channel_SW14        ((uint8_t)(26))
#define DMA_Channel_SW15        ((uint8_t)(27))
#define DMA_Channel_SW16        ((uint8_t)(28))
#define DMA_Channel_SW17        ((uint8_t)(29))
#define DMA_Channel_SW18        ((uint8_t)(30))
#define DMA_Channel_SW19        ((uint8_t)(31))

#elif defined (USE_MDR1986VE1T)

/*-- req DMA request ---------------------------------------------------------*/
#define DMA_Channel_REQ_UART1_TX    ((uint8_t)(0))
#define DMA_Channel_REQ_UART1_RX    ((uint8_t)(1))
#define DMA_Channel_REQ_UART2_TX    ((uint8_t)(2))
#define DMA_Channel_REQ_UART2_RX    ((uint8_t)(3))
#define DMA_Channel_REQ_SSP1_TX     ((uint8_t)(4))
#define DMA_Channel_REQ_SSP1_RX     ((uint8_t)(5))
#define DMA_Channel_REQ_SSP2_TX     ((uint8_t)(6))
#define DMA_Channel_REQ_SSP2_RX     ((uint8_t)(7))
#define DMA_Channel_REQ_SSP3_TX     ((uint8_t)(8))
#define DMA_Channel_REQ_SSP3_RX     ((uint8_t)(9))
#define DMA_Channel_REQ_TIM1        ((uint8_t)(10))
#define DMA_Channel_REQ_TIM2        ((uint8_t)(11))
#define DMA_Channel_REQ_TIM3        ((uint8_t)(12))
#define DMA_Channel_REQ_TIM4        ((uint8_t)(13))
#define DMA_Channel_SW1           ((uint8_t)(14))
#define DMA_Channel_SW2           ((uint8_t)(15))
#define DMA_Channel_SW3             ((uint8_t)(16))
#define DMA_Channel_SW4           ((uint8_t)(17))
#define DMA_Channel_SW5           ((uint8_t)(18))
#define DMA_Channel_SW6           ((uint8_t)(19))
#define DMA_Channel_SW7           ((uint8_t)(20))
#define DMA_Channel_SW8           ((uint8_t)(21))
#define DMA_Channel_SW9           ((uint8_t)(22))
#define DMA_Channel_SW10      ((uint8_t)(23))
#define DMA_Channel_SW11      ((uint8_t)(24))
#define DMA_Channel_SW12      ((uint8_t)(25))
#define DMA_Channel_SW13      ((uint8_t)(26))
#define DMA_Channel_SW14      ((uint8_t)(27))
#define DMA_Channel_SW15      ((uint8_t)(28))
#define DMA_Channel_SW16      ((uint8_t)(29))
#define DMA_Channel_SW17      ((uint8_t)(30))
#define DMA_Channel_SW18      ((uint8_t)(31))

/*-- sreq DMA request --------------------------------------------------------*/
#define DMA_Channel_SREQ_UART1_TX    ((uint8_t)(0))
#define DMA_Channel_SREQ_UART1_RX    ((uint8_t)(1))
#define DMA_Channel_SREQ_UART2_TX    ((uint8_t)(2))
#define DMA_Channel_SREQ_UART2_RX    ((uint8_t)(3))
#define DMA_Channel_SREQ_SSP1_TX     ((uint8_t)(4))
#define DMA_Channel_SREQ_SSP1_RX     ((uint8_t)(5))
#define DMA_Channel_SREQ_SSP2_TX     ((uint8_t)(6))
#define DMA_Channel_SREQ_SSP2_RX     ((uint8_t)(7))
#define DMA_Channel_SREQ_SSP3_TX     ((uint8_t)(8))
#define DMA_Channel_SREQ_SSP3_RX     ((uint8_t)(9))
#define DMA_Channel_SREQ_TIM1        ((uint8_t)(10))
#define DMA_Channel_SREQ_TIM2        ((uint8_t)(11))
#define DMA_Channel_SREQ_TIM3        ((uint8_t)(12))
#define DMA_Channel_SREQ_TIM4        ((uint8_t)(13))
#define DMA_Channel_SREQ_TIM1_REQ1   ((uint8_t)(14))
#define DMA_Channel_SREQ_TIM1_REQ2   ((uint8_t)(15))
#define DMA_Channel_SREQ_TIM1_REQ3   ((uint8_t)(16))
#define DMA_Channel_SREQ_TIM1_REQ4   ((uint8_t)(17))
#define DMA_Channel_SREQ_TIM2_REQ1   ((uint8_t)(18))
#define DMA_Channel_SREQ_TIM2_REQ2   ((uint8_t)(19))
#define DMA_Channel_SREQ_TIM2_REQ3   ((uint8_t)(20))
#define DMA_Channel_SREQ_TIM2_REQ4   ((uint8_t)(21))
#define DMA_Channel_SREQ_TIM3_REQ1   ((uint8_t)(22))
#define DMA_Channel_SREQ_TIM3_REQ2   ((uint8_t)(23))
#define DMA_Channel_SREQ_TIM3_REQ3   ((uint8_t)(24))
#define DMA_Channel_SREQ_TIM3_REQ4   ((uint8_t)(25))
#define DMA_Channel_SREQ_TIM4_REQ1   ((uint8_t)(26))
#define DMA_Channel_SREQ_TIM4_REQ2   ((uint8_t)(27))
#define DMA_Channel_SREQ_TIM4_REQ3   ((uint8_t)(28))
#define DMA_Channel_SREQ_TIM4_REQ4   ((uint8_t)(29))
#define DMA_Channel_SREQ_ADCDMA    ((uint8_t)(30))
#define DMA_Channel_SREQ_SW1         ((uint8_t)(31))

#elif defined (USE_MDR1986VE3)

