eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_dma.h
/*-- req DMA request ---------------------------------------------------------*/
#define DMA_Channel_REQ_UART1_TX    ((uint8_t)(0))
#define DMA_Channel_REQ_UART1_RX    ((uint8_t)(1))
#define DMA_Channel_REQ_UART2_TX    ((uint8_t)(2))
#define DMA_Channel_REQ_UART2_RX    ((uint8_t)(3))
#define DMA_Channel_REQ_SSP1_TX     ((uint8_t)(4))
#define DMA_Channel_REQ_SSP1_RX     ((uint8_t)(5))
#define DMA_Channel_REQ_SSP2_TX     ((uint8_t)(6))
#define DMA_Channel_REQ_SSP2_RX     ((uint8_t)(7))
#define DMA_Channel_REQ_SSP3_TX     ((uint8_t)(8))
#define DMA_Channel_REQ_SSP3_RX     ((uint8_t)(9))
#define DMA_Channel_REQ_TIM1        ((uint8_t)(10))
#define DMA_Channel_REQ_TIM2        ((uint8_t)(11))
#define DMA_Channel_REQ_TIM3        ((uint8_t)(12))
#define DMA_Channel_REQ_TIM4        ((uint8_t)(13))
#define DMA_Channel_SW1           ((uint8_t)(14))
#define DMA_Channel_SW2           ((uint8_t)(15))
#define DMA_Channel_SW3             ((uint8_t)(16))
#define DMA_Channel_SW4           ((uint8_t)(17))
#define DMA_Channel_SW5           ((uint8_t)(18))
#define DMA_Channel_SW6           ((uint8_t)(19))
#define DMA_Channel_SW7           ((uint8_t)(20))
#define DMA_Channel_SW8           ((uint8_t)(21))
#define DMA_Channel_SW9           ((uint8_t)(22))
#define DMA_Channel_REQ_SSP4_RX     ((uint8_t)(23))
#define DMA_Channel_REQ_UART3_TX    ((uint8_t)(24))
#define DMA_Channel_REQ_UART3_RX    ((uint8_t)(25))
#define DMA_Channel_REQ_UART4_TX    ((uint8_t)(26))
#define DMA_Channel_REQ_UART4_RX    ((uint8_t)(27))
#define DMA_Channel_REQ_SSP4_TX     ((uint8_t)(28))
#define DMA_Channel_REQ_AUDIO_TX  ((uint8_t)(29))
#define DMA_Channel_SW10          ((uint8_t)(30))
#define DMA_Channel_REQ_AUDIO_RX    ((uint8_t)(31))

/*-- sreq DMA request --------------------------------------------------------*/
#define DMA_Channel_SREQ_UART1_TX    ((uint8_t)(0))
#define DMA_Channel_SREQ_UART1_RX    ((uint8_t)(1))
#define DMA_Channel_SREQ_UART2_TX    ((uint8_t)(2))
#define DMA_Channel_SREQ_UART2_RX    ((uint8_t)(3))
#define DMA_Channel_SREQ_SSP1_TX     ((uint8_t)(4))
#define DMA_Channel_SREQ_SSP1_RX     ((uint8_t)(5))
#define DMA_Channel_SREQ_SSP2_TX     ((uint8_t)(6))
#define DMA_Channel_SREQ_SSP2_RX     ((uint8_t)(7))
#define DMA_Channel_SREQ_SSP3_TX     ((uint8_t)(8))
#define DMA_Channel_SREQ_SSP3_RX     ((uint8_t)(9))
#define DMA_Channel_SREQ_TIM1        ((uint8_t)(10))
#define DMA_Channel_SREQ_TIM2        ((uint8_t)(11))
#define DMA_Channel_SREQ_TIM3        ((uint8_t)(12))
#define DMA_Channel_SREQ_TIM4        ((uint8_t)(13))
#define DMA_Channel_SREQ_TIM1_REQ1   ((uint8_t)(14))
#define DMA_Channel_SREQ_TIM1_REQ2   ((uint8_t)(15))
#define DMA_Channel_SREQ_TIM1_REQ3   ((uint8_t)(16))
#define DMA_Channel_SREQ_TIM1_REQ4   ((uint8_t)(17))
#define DMA_Channel_SREQ_TIM2_REQ1   ((uint8_t)(18))
#define DMA_Channel_SREQ_TIM2_REQ2   ((uint8_t)(19))
#define DMA_Channel_SREQ_TIM2_REQ3   ((uint8_t)(20))
#define DMA_Channel_SREQ_TIM2_REQ4   ((uint8_t)(21))
#define DMA_Channel_SREQ_TIM3_REQ1   ((uint8_t)(22))
#define DMA_Channel_SREQ_TIM3_REQ2   ((uint8_t)(23))
#define DMA_Channel_SREQ_TIM3_REQ3   ((uint8_t)(24))
#define DMA_Channel_SREQ_TIM3_REQ4   ((uint8_t)(25))
#define DMA_Channel_SREQ_TIM4_REQ1   ((uint8_t)(26))
#define DMA_Channel_SREQ_TIM4_REQ2   ((uint8_t)(27))
#define DMA_Channel_SREQ_TIM4_REQ3   ((uint8_t)(28))
#define DMA_Channel_SREQ_TIM4_REQ4   ((uint8_t)(29))
#define DMA_Channel_SREQ_ADCDMA    ((uint8_t)(30))
#define DMA_Channel_SREQ_SW1         ((uint8_t)(31))

#endif

#define IS_DMA_CHANNEL(CHANNEL) (CHANNEL <= (DMA_Channels_Number - 1))

/** @} */ /* End of group DMA_valid_channels */

/** @defgroup DMA_source_incremented_mode DMA source incremented mode
  * @{
  */

#define DMA_SourceIncByte                   ((uint32_t)(0 << 26))
#define DMA_SourceIncHalfword               ((uint32_t)(1 << 26))
#define DMA_SourceIncWord                   ((uint32_t)(2 << 26))
#define DMA_SourceIncNo                     ((uint32_t)(3 << 26))
#define IS_DMA_SOURCE_INC_STATE(STATE)      (((STATE) == DMA_SourceIncByte)     || \
                                            ((STATE)  == DMA_SourceIncHalfword) || \
                                            ((STATE)  == DMA_SourceIncWord)     || \
                                            ((STATE)  == DMA_SourceIncNo))

/** @} */ /* End of group DMA_source_incremented_mode */

/** @defgroup DMA_dest_incremented_mode DMA dest incremented mode
  * @{
  */

#define DMA_DestIncByte                 ((uint32_t)(0x0UL << 30))
#define DMA_DestIncHalfword             ((uint32_t)(0x1UL << 30))
#define DMA_DestIncWord                 ((uint32_t)(0x2UL << 30))
#define DMA_DestIncNo                   ((uint32_t)(0x3UL << 30))
#define IS_DMA_DEST_INC_STATE(STATE)    (((STATE) == DMA_DestIncByte)       || \
                                        ((STATE)  == DMA_DestIncHalfword)   || \
                                        ((STATE)  == DMA_DestIncWord)       || \
                                        ((STATE)  == DMA_DestIncNo))

/** @} */ /* End of group DMA_dest_incremented_mode */

/** @defgroup DMA_memory_data_size DMA memory data size
  * @{
  */

#define DMA_MemoryDataSize_Byte        ((uint32_t)(0x00 << 24))
#define DMA_MemoryDataSize_HalfWord    ((uint32_t)(0x11 << 24))
#define DMA_MemoryDataSize_Word        ((uint32_t)(0x22 << 24))
#define IS_DMA_MEMORY_DATA_SIZE(SIZE) (((SIZE) == DMA_MemoryDataSize_Byte)      || \
                                       ((SIZE) == DMA_MemoryDataSize_HalfWord)  || \
                                       ((SIZE) == DMA_MemoryDataSize_Word))

/** @} */ /* End of group DMA_memory_data_size */

/** @defgroup DMA_operating_mode DMA operating mode
  * @{
  */

#define DMA_Mode_Stop                       ((uint32_t)0x0)
#define DMA_Mode_Basic                      ((uint32_t)0x1)
#define DMA_Mode_AutoRequest                ((uint32_t)0x2)
#define DMA_Mode_PingPong                   ((uint32_t)0x3)
#define DMA_Mode_MemScatterPri              ((uint32_t)0x4)
#define DMA_Mode_MemScatterAlt              ((uint32_t)0x5)
#define DMA_Mode_PerScatterPri              ((uint32_t)0x6)
#define DMA_Mode_PerScatterAlt              ((uint32_t)0x7)
#define DMA_Mode_PerScatterAltBurst         ((uint32_t)0xF)

